       05  BOOKDSTR-CTRL.
           10 BOOKDSTR-CTRL-COD        PIC 9(001)          VALUE ZEROS.
           10 BOOKDSTR-CTRL-MSG        PIC X(040)          VALUE SPACES.
