       05  BOOKVRIF-CTRL.
           10 BOOKVRIF-CTRL-COD        PIC 9(001)          VALUE ZEROS.
           10 BOOKVRIF-CTRL-MSG        PIC X(040)          VALUE SPACES.
       05  BOOKVRIF-REG.
           10 BOOKVRIF-REG-CPF         PIC 9(011)          VALUE ZEROS.
           10 BOOKVRIF-REG-CNPJ        PIC 9(014)          VALUE ZEROS.
